---
kind: method
id: M:Autodesk.Revit.DB.FBXExportOptions.#ctor
source: html/94e6c8fe-f61c-0d27-45d8-e32ab882e51a.htm
---
# Autodesk.Revit.DB.FBXExportOptions.#ctor Method

Default constructor. Sets all options to their default values.

## Syntax (C#)
```csharp
public FBXExportOptions()
```